###################################################################

# Created by write_sdc on Sat Oct 12 00:04:59 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports ST]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {G[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {P[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {Y[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {X[0]}]
set_load -pin_load 0.184576 [get_ports {OUT[47]}]
set_load -pin_load 0.184576 [get_ports {OUT[46]}]
set_load -pin_load 0.184576 [get_ports {OUT[45]}]
set_load -pin_load 0.184576 [get_ports {OUT[44]}]
set_load -pin_load 0.184576 [get_ports {OUT[43]}]
set_load -pin_load 0.184576 [get_ports {OUT[42]}]
set_load -pin_load 0.184576 [get_ports {OUT[41]}]
set_load -pin_load 0.184576 [get_ports {OUT[40]}]
set_load -pin_load 0.184576 [get_ports {OUT[39]}]
set_load -pin_load 0.184576 [get_ports {OUT[38]}]
set_load -pin_load 0.184576 [get_ports {OUT[37]}]
set_load -pin_load 0.184576 [get_ports {OUT[36]}]
set_load -pin_load 0.184576 [get_ports {OUT[35]}]
set_load -pin_load 0.184576 [get_ports {OUT[34]}]
set_load -pin_load 0.184576 [get_ports {OUT[33]}]
set_load -pin_load 0.184576 [get_ports {OUT[32]}]
set_load -pin_load 0.184576 [get_ports {OUT[31]}]
set_load -pin_load 0.184576 [get_ports {OUT[30]}]
set_load -pin_load 0.184576 [get_ports {OUT[29]}]
set_load -pin_load 0.184576 [get_ports {OUT[28]}]
set_load -pin_load 0.184576 [get_ports {OUT[27]}]
set_load -pin_load 0.184576 [get_ports {OUT[26]}]
set_load -pin_load 0.184576 [get_ports {OUT[25]}]
set_load -pin_load 0.184576 [get_ports {OUT[24]}]
set_load -pin_load 0.184576 [get_ports {OUT[23]}]
set_load -pin_load 0.184576 [get_ports {OUT[22]}]
set_load -pin_load 0.184576 [get_ports {OUT[21]}]
set_load -pin_load 0.184576 [get_ports {OUT[20]}]
set_load -pin_load 0.184576 [get_ports {OUT[19]}]
set_load -pin_load 0.184576 [get_ports {OUT[18]}]
set_load -pin_load 0.184576 [get_ports {OUT[17]}]
set_load -pin_load 0.184576 [get_ports {OUT[16]}]
set_load -pin_load 0.184576 [get_ports {OUT[15]}]
set_load -pin_load 0.184576 [get_ports {OUT[14]}]
set_load -pin_load 0.184576 [get_ports {OUT[13]}]
set_load -pin_load 0.184576 [get_ports {OUT[12]}]
set_load -pin_load 0.184576 [get_ports {OUT[11]}]
set_load -pin_load 0.184576 [get_ports {OUT[10]}]
set_load -pin_load 0.184576 [get_ports {OUT[9]}]
set_load -pin_load 0.184576 [get_ports {OUT[8]}]
set_load -pin_load 0.184576 [get_ports {OUT[7]}]
set_load -pin_load 0.184576 [get_ports {OUT[6]}]
set_load -pin_load 0.184576 [get_ports {OUT[5]}]
set_load -pin_load 0.184576 [get_ports {OUT[4]}]
set_load -pin_load 0.184576 [get_ports {OUT[3]}]
set_load -pin_load 0.184576 [get_ports {OUT[2]}]
set_load -pin_load 0.184576 [get_ports {OUT[1]}]
set_load -pin_load 0.184576 [get_ports {OUT[0]}]
create_clock [get_ports CLK]  -period 666  -waveform {0 333}
set_clock_latency 0  [get_clocks CLK]
set_clock_uncertainty 0.1  [get_clocks CLK]
set_clock_transition -max -rise 0.05 [get_clocks CLK]
set_clock_transition -min -rise 0.05 [get_clocks CLK]
set_clock_transition -max -fall 0.05 [get_clocks CLK]
set_clock_transition -min -fall 0.05 [get_clocks CLK]
set_input_delay -clock CLK  0.037  [get_ports {G[31]}]
set_input_delay -clock CLK  0.037  [get_ports {G[30]}]
set_input_delay -clock CLK  0.037  [get_ports {G[29]}]
set_input_delay -clock CLK  0.037  [get_ports {G[28]}]
set_input_delay -clock CLK  0.037  [get_ports {G[27]}]
set_input_delay -clock CLK  0.037  [get_ports {G[26]}]
set_input_delay -clock CLK  0.037  [get_ports {G[25]}]
set_input_delay -clock CLK  0.037  [get_ports {G[24]}]
set_input_delay -clock CLK  0.037  [get_ports {G[23]}]
set_input_delay -clock CLK  0.037  [get_ports {G[22]}]
set_input_delay -clock CLK  0.037  [get_ports {G[21]}]
set_input_delay -clock CLK  0.037  [get_ports {G[20]}]
set_input_delay -clock CLK  0.037  [get_ports {G[19]}]
set_input_delay -clock CLK  0.037  [get_ports {G[18]}]
set_input_delay -clock CLK  0.037  [get_ports {G[17]}]
set_input_delay -clock CLK  0.037  [get_ports {G[16]}]
set_input_delay -clock CLK  0.037  [get_ports {G[15]}]
set_input_delay -clock CLK  0.037  [get_ports {G[14]}]
set_input_delay -clock CLK  0.037  [get_ports {G[13]}]
set_input_delay -clock CLK  0.037  [get_ports {G[12]}]
set_input_delay -clock CLK  0.037  [get_ports {G[11]}]
set_input_delay -clock CLK  0.037  [get_ports {G[10]}]
set_input_delay -clock CLK  0.037  [get_ports {G[9]}]
set_input_delay -clock CLK  0.037  [get_ports {G[8]}]
set_input_delay -clock CLK  0.037  [get_ports {G[7]}]
set_input_delay -clock CLK  0.037  [get_ports {G[6]}]
set_input_delay -clock CLK  0.037  [get_ports {G[5]}]
set_input_delay -clock CLK  0.037  [get_ports {G[4]}]
set_input_delay -clock CLK  0.037  [get_ports {G[3]}]
set_input_delay -clock CLK  0.037  [get_ports {G[2]}]
set_input_delay -clock CLK  0.037  [get_ports {G[1]}]
set_input_delay -clock CLK  0.037  [get_ports {G[0]}]
set_input_delay -clock CLK  0.037  [get_ports ST]
set_input_delay -clock CLK  0.037  [get_ports {P[31]}]
set_input_delay -clock CLK  0.037  [get_ports {P[30]}]
set_input_delay -clock CLK  0.037  [get_ports {P[29]}]
set_input_delay -clock CLK  0.037  [get_ports {P[28]}]
set_input_delay -clock CLK  0.037  [get_ports {P[27]}]
set_input_delay -clock CLK  0.037  [get_ports {P[26]}]
set_input_delay -clock CLK  0.037  [get_ports {P[25]}]
set_input_delay -clock CLK  0.037  [get_ports {P[24]}]
set_input_delay -clock CLK  0.037  [get_ports {P[23]}]
set_input_delay -clock CLK  0.037  [get_ports {P[22]}]
set_input_delay -clock CLK  0.037  [get_ports {P[21]}]
set_input_delay -clock CLK  0.037  [get_ports {P[20]}]
set_input_delay -clock CLK  0.037  [get_ports {P[19]}]
set_input_delay -clock CLK  0.037  [get_ports {P[18]}]
set_input_delay -clock CLK  0.037  [get_ports {P[17]}]
set_input_delay -clock CLK  0.037  [get_ports {P[16]}]
set_input_delay -clock CLK  0.037  [get_ports {P[15]}]
set_input_delay -clock CLK  0.037  [get_ports {P[14]}]
set_input_delay -clock CLK  0.037  [get_ports {P[13]}]
set_input_delay -clock CLK  0.037  [get_ports {P[12]}]
set_input_delay -clock CLK  0.037  [get_ports {P[11]}]
set_input_delay -clock CLK  0.037  [get_ports {P[10]}]
set_input_delay -clock CLK  0.037  [get_ports {P[9]}]
set_input_delay -clock CLK  0.037  [get_ports {P[8]}]
set_input_delay -clock CLK  0.037  [get_ports {P[7]}]
set_input_delay -clock CLK  0.037  [get_ports {P[6]}]
set_input_delay -clock CLK  0.037  [get_ports {P[5]}]
set_input_delay -clock CLK  0.037  [get_ports {P[4]}]
set_input_delay -clock CLK  0.037  [get_ports {P[3]}]
set_input_delay -clock CLK  0.037  [get_ports {P[2]}]
set_input_delay -clock CLK  0.037  [get_ports {P[1]}]
set_input_delay -clock CLK  0.037  [get_ports {P[0]}]
set_input_delay -clock CLK  0.037  [get_ports {X[31]}]
set_input_delay -clock CLK  0.037  [get_ports {X[30]}]
set_input_delay -clock CLK  0.037  [get_ports {X[29]}]
set_input_delay -clock CLK  0.037  [get_ports {X[28]}]
set_input_delay -clock CLK  0.037  [get_ports {X[27]}]
set_input_delay -clock CLK  0.037  [get_ports {X[26]}]
set_input_delay -clock CLK  0.037  [get_ports {X[25]}]
set_input_delay -clock CLK  0.037  [get_ports {X[24]}]
set_input_delay -clock CLK  0.037  [get_ports {X[23]}]
set_input_delay -clock CLK  0.037  [get_ports {X[22]}]
set_input_delay -clock CLK  0.037  [get_ports {X[21]}]
set_input_delay -clock CLK  0.037  [get_ports {X[20]}]
set_input_delay -clock CLK  0.037  [get_ports {X[19]}]
set_input_delay -clock CLK  0.037  [get_ports {X[18]}]
set_input_delay -clock CLK  0.037  [get_ports {X[17]}]
set_input_delay -clock CLK  0.037  [get_ports {X[16]}]
set_input_delay -clock CLK  0.037  [get_ports {X[15]}]
set_input_delay -clock CLK  0.037  [get_ports {X[14]}]
set_input_delay -clock CLK  0.037  [get_ports {X[13]}]
set_input_delay -clock CLK  0.037  [get_ports {X[12]}]
set_input_delay -clock CLK  0.037  [get_ports {X[11]}]
set_input_delay -clock CLK  0.037  [get_ports {X[10]}]
set_input_delay -clock CLK  0.037  [get_ports {X[9]}]
set_input_delay -clock CLK  0.037  [get_ports {X[8]}]
set_input_delay -clock CLK  0.037  [get_ports {X[7]}]
set_input_delay -clock CLK  0.037  [get_ports {X[6]}]
set_input_delay -clock CLK  0.037  [get_ports {X[5]}]
set_input_delay -clock CLK  0.037  [get_ports {X[4]}]
set_input_delay -clock CLK  0.037  [get_ports {X[3]}]
set_input_delay -clock CLK  0.037  [get_ports {X[2]}]
set_input_delay -clock CLK  0.037  [get_ports {X[1]}]
set_input_delay -clock CLK  0.037  [get_ports {X[0]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[31]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[30]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[29]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[28]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[27]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[26]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[25]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[24]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[23]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[22]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[21]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[20]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[19]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[18]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[17]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[16]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[15]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[14]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[13]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[12]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[11]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[10]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[9]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[8]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[7]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[6]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[5]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[4]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[3]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[2]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[1]}]
set_input_delay -clock CLK  0.037  [get_ports {Y[0]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[47]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[46]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[45]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[44]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[43]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[42]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[41]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[40]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[39]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[38]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[37]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[36]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[35]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[34]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[33]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[32]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[31]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[30]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[29]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[28]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[27]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[26]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[25]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[24]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[23]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[22]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[21]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[20]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[19]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[18]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[17]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[16]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[15]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[14]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[13]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[12]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[11]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[10]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[9]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[8]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[7]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[6]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[5]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[4]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[3]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[2]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[1]}]
set_output_delay -clock CLK  0.037  [get_ports {OUT[0]}]
